<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111: Introduction to Databases<br>
Spring 2023, Sections 002
</span>
</center></b>
<br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Homework 1: Introduction to Core Concepts, ER Modeling, Relational Algebra, SQL<br>
</span>
</center></i>

# Introduction and Overview

## HW Objectives

## Submission Instructions

Complete all the tests in this notebook and submit only this notebook as a PDF to GradeScope. To convert the jupyter notebook into a pdf you can use either of the following methods:

- File --> Print Preview --> Print --> Save to PDF 

- File --> Download As HTML --> Print --> Save to PDF


__Due date: September 29, 11:59 PM EDT on GradeScope__

Please note: You may NOT use late days for the submission of this assignment. Check Courseworks for GradeScope access. 


It is recommended that you put the screenshots into the same folder as this notebook so you do not have to alter the path to include your images. 


Please read all the instructions thoroughly!

## Guidelines

You may not work with or collaborate with anyone in any way to complete the homework. You may speak with the professor and TAs. You may ask __private__ questions on Ed if you need clarification.


You may use lecture slides, the textbook slides, the textbook or public information on the web to help you answer your questions. You may not "cut and past" information. Your answer must be in your own words and demonstrate the you understand the concept. If you use information for sources other than lectures, lecture slides, textbook slides or the textbook, you MUST provide a URL to the source you used.

Read the Columbia University [academic integrity information.](https://www.cc-seas.columbia.edu/integrity). In the answer section, state that you take the pledge.

_Answer:_

## Add Student Information

1. Replace my name with your full name.
2. Replace my UNI with your UNI.
3. Replace "Cool Track" with either "Programming" or "Non-programming."

In [ ]:
# Print your name, uni, and track below

name = "Donald F. Ferguson"
uni = "dff9"
track = "Cool Track"

print(name)
print(uni)
print(track)

# Testing Environment

Run the following cells to ensure that your environment is set up.


You may need to change passwords.

In [2]:
%load_ext sql

In [3]:
%sql mysql+pymysql://root:dbuserdbuser@localhost

In [4]:
%sql select * from db_book.student where ID=12345

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('12345', 'Shankar', 'Comp. Sci.', Decimal('32'))]

In [5]:
from sqlalchemy import create_engine

In [6]:
engine = create_engine("mysql+pymysql://root:dbuserdbuser@localhost")

In [8]:
def get_connection(userid, pw):
    conn = pymysql.connect(
        host="localhost",
        user=userid,
        passwd=pw,
        autocommit=True,
        cursorclass=pymysql.cursors.DictCursor
    )
    return conn

pymysql_conn = get_connection("root", "dbuserdbuser")

In [9]:
dept_name="Comp. Sci."
total_cred=50

cur = pymysql_conn.cursor()

sql = "select * from db_book.student where dept_name=%s and tot_cred >= %s"

res = cur.execute(sql, args=(dept_name, total_cred))

In [10]:
print("The number of rows in the result is", res)

The number of rows in the result is 3

In [11]:
students = cur.fetchall()
students

[{'ID': '00128',
  'name': 'Zhang',
  'dept_name': 'Comp. Sci.',
  'tot_cred': Decimal('102')},
 {'ID': '54321',
  'name': 'Williams',
  'dept_name': 'Comp. Sci.',
  'tot_cred': Decimal('54')},
 {'ID': '76543',
  'name': 'Brown',
  'dept_name': 'Comp. Sci.',
  'tot_cred': Decimal('58')}]

In [12]:
import pandas

In [13]:
data_dir = "./data"

In [14]:
df = pandas.read_csv(data_dir + "/" + "departments.csv")

In [15]:
df

   COMS                             Computer Science
0  MATH                                  Mathematics
1  IEOR   Industrial Engineering/Operations Research
2  ECON                                    Economics

In [16]:
%sql create database if not exists W4111_HW1

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [17]:
df.to_sql("departments", schema="W4111_HW1", index=False, if_exists="replace", con=engine)

3

In [18]:
%sql select * from w4111_hw1.departments

 * mysql+pymysql://root:***@localhost
3 rows affected.

[('MATH', ' Mathematics'),
 ('IEOR', ' Industrial Engineering/Operations Research'),
 ('ECON', ' Economics')]

# Written Questions

<hr style="height:2px;">

__W1:__ Briefly explain 4 types of database user. Briefly explain a database administrator.

_Answer:_

<hr style="height:2px;">

__W2:__ Briefly explain structured data and unstructured data. Give an example of each.

_Answer:_

<hr style="height:2px;">

__W3:__  Briefly define the following terms. Give an example of each using the sample database associated with the recommended textbook.


1. Super Key<br><br>
1. Candidate Key<br><br>
1. Primary Key<br><br>
1. Foreign Key

_Answer:_

<hr style="height:2px;">

__W4:__ Columbia University uses several applications that use databases to run the university. Examples are SSOL and CourseWorks. An alternate approach could be letting students, faculty, admimistrators, etc. use shared Google Sheets to create, retrieve, update and delete information. What are some problems with the shared sheet approach and what functions do DMBS implement to solve the problems.

_Answer:_

<hr style="height:2px;">

__W5:__ The relational algebra is is closed under the operators. Explain what this means and give an example.

_Answer:_

<hr style="height:2px;">

__W6:__ SQL is a _declarative_ data manipulation language. What are some pros and cons of declarative DMLs relative to procedural DMLs?

_Answer:_

<hr style="height:2px;">

__W7:__ Briefly explain the concepts of database _schema_ and _instance._ Give an example from the sample database associated with the recommended textbook.

_Answer:_

<hr style="height:2px;">

__W8:__ What is the _semi-structured data model_ and how is it different from the relational data model?

_Answer:_

<hr style="height:2px;">

__W9:__ Some of the Columbia University databases/applications represent the year/semester attribute of a section in the form "2023_2." Where the first for characters are the academic year, and the last character is the semester (1, 2, or 3). The data type for this attribute might be ```char(6)``` or ```str.``` Explain the concepts of _domain_ and _atomic domain_ and the difference from type using this example.

_Answer:_

<hr style="height:2px;">

__W4:__ Columbia University uses several applications that use databases to run the university. Examples are SSOL and CourseWorks. An alternate approach could be letting students, faculty, admimistrators, etc. use shared Google Sheets to create, retrieve, update and delete information. What are some problems with the shared sheet approach and what functions do DMBS implement to solve the problems.

_Answer:_

# Relational Algebra

<hr style="height:2px;">

__R1:__ Defining relations: The following is the SQL DDL for the ```db_book.classroom``` table.

```
create table if not exists db_book.classroom
(
    building    varchar(15) not null,
    room_number varchar(7)  not null,
    capacity    decimal(4)  null,
    primary key (building, room_number)
);
```

Using the notation/format from the lecture slides, provide the corresponding relational model/algebra definition. You do not need to worry about data types, null/not null, ... ....

_Answer:_

<hr style="height:2px;">

__S1:__ This is a sample of the format for answering the relational algebra questions. Your answer will contain:
1. A markdown cell with the relational algebra statement.
2. A screen capture of the execution.

You will use the [RelaX calculator](https://dbis-uibk.github.io/relax/calc/gist/4f7866c17624ca9dfa85ed2482078be8/relax-silberschatz-english.txt/0) with the schema associated with the book.

Write a relational algebra statement that produces a relation with the columns:
- section.course_id
- section.sec_id
- section.semester
- section.year
- section.building
- section.room_number
- classroom.capacity

And only contains tuples from the ```Spring``` semester and a ```classroom.capacity > 50.```

_Answer:_

Algebra statement.

```
σ semester='Spring'∧capacity>50
	(π course_id, sec_id, semester, year, building, room_number, capacity
		(section ⨝ classroom)
		)
```

Screen capture:

<img src="./s1.jpg">

<hr style="height:2px;">

__R2:__ Write a relational algebra expression that returns a relation of the form:
- section.course_id
- section.sec_id
- section.semester
- section.year
- teaches.ID
- instructor.name
- course.credits

The relation contains courses that earn at least 4 credits.

_Answer:_

Relational algebra:

Screen capture:

<hr style="height:2px;">

# Data Modeling

In [77]:
lahmans_files = [
    'People.csv',
    ''
]

Appearances.csv                       course_info.json
Batting.csv                           departments.csv
People.csv                            evalkit_eval_courses_instructors.json
Pitching.csv                          evalkit_eval_instructors.json
course_feed.json                      instructors.json

In [64]:
%sql use w4111_hw1;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [65]:
%sql select * from cu_departments limit 20;

 * mysql+pymysql://root:***@localhost
20 rows affected.

[('Accounting', 'ACCT'),
 ('Actuarial Science', 'ACTU'),
 ('Summer Session', 'SUMM'),
 ('Africana Studies (barnard)', 'AFSB'),
 ('Art History (barnard)', 'ARHB'),
 ('Art History & Archaeology', 'AHAR'),
 ('Asian/middle East (barnard)', 'ASMB'),
 ('Sps Pre-college Program', 'SHSP'),
 ('American Studies (barnard)', 'AMSB'),
 ('Classics (barnard)', 'CLSB'),
 ('Anesthesiology', 'ANES'),
 ('Anthropology (barnard)', 'ANTB'),
 ('Applied Physics & Applied Math', 'APAM'),
 ('Applied Analytics', 'APAN'),
 ('Video Network', 'VDEO'),
 ('Architecture, Planning & Prese', 'ARPL'),
 ('Architecture (barnard)', 'ARCB'),
 ('Physics & Astronomy (barnard)', 'PHYB'),
 ('Pre-college Program (barnard)', 'PCPP'),
 ('Bioethics', 'BIET')]

In [74]:
%sql select * from sections_fixed_2 limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('ACCTB5001_XMT_2021_2', 'ACCT5001BXMT', 'ACCT', '5001', 'B', 'XMT', 'Accounting I: Financial Accoun', 'Financial Accounting', 'SOURSOURIAN, JESSICA', 'SBUS', '', '14481', '2021', '2'),
 ('ACCTB5001_001_2021_2', 'ACCT5001B001', 'ACCT', '5001', 'B', '001', 'Accounting I: Financial Accoun', 'Financial Accounting', 'ZIV, AMIR', 'SBUS', '030', '12440', '2021', '2'),
 ('ACCTB5001_002_2021_2', 'ACCT5001B002', 'ACCT', '5001', 'B', '002', 'Accounting I: Financial Accoun', 'Financial Accounting', 'ZIV, AMIR', 'SBUS', '030', '12441', '2021', '2'),
 ('ACCTB5001_300_2021_2', 'ACCT5001B300', 'ACCT', '5001', 'B', '300', 'Accounting I: Financial Accoun', 'Financial Accounting', 'ZIV, AMIR', 'SBUS', '030', '12442', '2021', '2'),
 ('ACCTB5001_400_2021_2', 'ACCT5001B400', 'ACCT', '5001', 'B', '400', 'Accounting I: Financial Accoun', 'Financial Accounting', 'FACULTY, .', 'SBUS', '030', '14266', '2021', '2'),
 ('ACCTB5902_300_2021_2', 'ACCT5902B300', 'ACCT', '5902', 'B', '300', 'Private Equity and Venture Cap', 'Private Equity and Ventur', 'SOURSOURIAN, JESSICA', 'SBUS', '030', '14479', '2021', '2'),
 ('ACCTB7009_001_2021_2', 'ACCT7009B001', 'ACCT', '7009', 'B', '001', 'Financial Statement Analysis a', 'Financial Statement Analy', 'RADHAKRISHNA, RADHA', 'SBUS', '030', '12449', '2021', '2'),
 ('ACCTB8007_001_2021_2', 'ACCT8007B001', 'ACCT', '8007', 'B', '001', 'Financial Planning & Analysis', 'Financial Planning & Anal', 'VAYSMAN, IGOR', 'SBUS', '015', '12251', '2021', '2'),
 ('ACCTB8009_D01_2021_2', 'ACCT8009BD01', 'ACCT', '8009', 'B', 'D01', 'Financial Statement Analysis a', 'Financial Statement Analy', 'BOURVEAU, THOMAS E', 'SBUS', '030', '12607', '2021', '2'),
 ('ACCTB8009_001_2021_2', 'ACCT8009B001', 'ACCT', '8009', 'B', '001', 'Financial Statement Analysis a', 'Financial Statement Analy', 'BOURVEAU, THOMAS E', 'SBUS', '030', '12252', '2021', '2')]

In [70]:
%sql select * from section_instructor limit 20

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('ERMCK5250_001_2020_3', 'rsf2133'),
 ('HISTW2439_002_2020_3', 'gm522'),
 ('GERMC1101_006_2020_3', 'sss2284'),
 ('ECONW4911_001_2020_3', 'skg21'),
 ('HISTW3815_001_2019_3', 'dgk2114'),
 ('CLENW3983_001_2021_3', 'bhe2'),
 ('CHNSW4012_001_2021_3', 'zs2132'),
 ('APANK5310_004_2020_3', 'nm2608'),
 ('MATHG6153_001_2021_1', 'ic2354'),
 ('LATNW4105_001_2019_3', 'gdw5')]

In [67]:
%sql select * from section_instructor limit 20;

 * mysql+pymysql://root:***@localhost
20 rows affected.

[('ERMCK5250_001_2020_3', 'rsf2133'),
 ('HISTW2439_002_2020_3', 'gm522'),
 ('GERMC1101_006_2020_3', 'sss2284'),
 ('ECONW4911_001_2020_3', 'skg21'),
 ('HISTW3815_001_2019_3', 'dgk2114'),
 ('CLENW3983_001_2021_3', 'bhe2'),
 ('CHNSW4012_001_2021_3', 'zs2132'),
 ('APANK5310_004_2020_3', 'nm2608'),
 ('MATHG6153_001_2021_1', 'ic2354'),
 ('LATNW4105_001_2019_3', 'gdw5'),
 ('SOCIG6097_001_2020_3', 'psb17'),
 ('BIETK5450_001_2019_3', 'rlk2'),
 ('MPP_W1427_001_2020_3', 'lk2595'),
 ('SDEVW3280_001_2021_1', 'jr438'),
 ('PUBHW4100_001_2021_1', 'dm2025'),
 ('SOCIW3914_001_2020_3', 'tad61'),
 ('COMMK5060_H07_2019_3', 'dw2767'),
 ('BINFG4011_001_2019_3', 'sk1312'),
 ('SPPOG6001_001_2021_1', 'fa2443'),
 ('WRITQ6400_002_2019_3', 'mey2107')]

In [76]:
%sql select * from instructors limit 10

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('Gamalinda', 'Mario Eric', 'meg2109', 'Mario Eric Gamalinda'),
 ('Quay', 'Michelle', 'mq2213', 'Michelle Quay'),
 ('Loetscher', 'Kyoko', 'kml2168', 'Kyoko Loetscher'),
 ('Araneo', 'Margaret', 'ma3749', 'Margaret Araneo'),
 ('Wu', 'Geraldine', 'gaw18', 'Geraldine Wu'),
 ('Cambareri', 'Giuseppina', 'gc2019', 'Giuseppina Cambareri'),
 ('Pilson', 'Neal', 'np2320', 'Neal Pilson'),
 ('Rosenthal', 'Mila', 'mhr22', 'Mila Rosenthal'),
 ('Shevchuk', 'Yuri', 'sy2165', 'Yuri Shevchuk'),
 ('Lincoln', 'Edward', 'el2692', 'Edward Lincoln')]

```

create table if not exists cu_departments
(
    departmentname text null,
    departmentcode text null
);


create table if not exists instructors
(
    lastname  text null,
    firstname text null,
    uni       text null,
    name      text null
);

create table if not exists sections_fixed_2
(
    section_id     varchar(20) null,
    section_full   text        null,
    dept_code      varchar(4)  null,
    course_no      varchar(4)  null,
    faculty_code   varchar(1)  null,
    section_no     varchar(3)  null,
    coursetitle    text        null,
    coursesubtitle text        null,
    instructorname text        null,
    schoolcode     text        null,
    numfixedunits  text        null,
    callnumber     text        null,
    section_year   varchar(4)  null,
    semester       varchar(1)  null
);

create table if not exists section_instructor
(
    section_no     text null,
    instructor_uni text null
);
```

```
create table if not exists courses
(
    CallNumber       text null,
    Term             text null,
    ExamMeet         text null,
    SubtermCode      text null,
    DivisionCode     text null,
    Instructor3Name  text null,
    NumFixedUnits    text null,
    DivisionName     text null,
    Meets5           text null,
    Meets1           text null,
    Meets6           text null,
    DepartmentName   text null,
    NumEnrolled      text null,
    Approval         text null,
    Meets2           text null,
    TypeName         text null,
    DepartmentCode   text null,
    Instructor4Name  text null,
    CourseTitle      text null,
    CampusCode       text null,
    TypeCode         text null,
    BulletinFlags    text null,
    EnrollmentStatus text null,
    ChargeMsg1       text null,
    Meets4           text null,
    MaxSize          text null,
    PrefixName       text null,
    ExamDate         text null,
    MinUnits         text null,
    Instructor2Name  text null,
    MaxUnits         text null,
    PrefixLongname   text null,
    SchoolName       text null,
    SchoolCode       text null,
    CampusName       text null,
    SubtermName      text null,
    CourseSubtitle   text null,
    Instructor1Name  text null,
    ChargeAmt2       text null,
    ChargeAmt1       text null,
    Course           text null,
    ChargeMsg2       text null,
    ClassNotes       text null,
    Meets3           text null
);





create table if not exists sections
(
    course          text null,
    coursetitle     text null,
    coursesubtitle  text null,
    instructor1name text null,
    schoolcode      text null,
    numfixedunits   text null,
    maxsize         text null,
    callnumber      text null,
    term            text null
);

create table if not exists sections_fixed
(
    section_full   text       null,
    dept_code      varchar(4) null,
    course_no      varchar(4) null,
    faculty_code   varchar(1) null,
    section_no     varchar(3) null,
    coursetitle    text       null,
    coursesubtitle text       null,
    instructorname text       null,
    schoolcode     text       null,
    numfixedunits  text       null,
    callnumber     text       null,
    section_year   varchar(4) null,
    semester       varchar(1) null
);

create table if not exists sections_fixed_2
(
    section_id     varchar(20) null,
    section_full   text        null,
    dept_code      varchar(4)  null,
    course_no      varchar(4)  null,
    faculty_code   varchar(1)  null,
    section_no     varchar(3)  null,
    coursetitle    text        null,
    coursesubtitle text        null,
    instructorname text        null,
    schoolcode     text        null,
    numfixedunits  text        null,
    callnumber     text        null,
    section_year   varchar(4)  null,
    semester       varchar(1)  null
);



```

In [19]:
import json

In [20]:
import os

In [22]:
p = os.path.join("/Users", "beans")
p

'/Users/beans'

In [26]:
instructor_file_name = os.path.join(
    "/Users",
    "donaldferguson",
    "Dropbox",
    "00Spring2023",
    "Intro_to_Databases_S23",
    "HW-Assignments",
    "Assignments",
    "S23-W4111-HW-1",
    "data",
    "instructors.json"
)
instructor_file_name = os.path.join(instructor_file_name)  
instructor_file_name

'/Users/donaldferguson/Dropbox/00Spring2023/Intro_to_Databases_S23/HW-Assignments/Assignments/S23-W4111-HW-1/data/instructors.json'

In [27]:
with open(instructor_file_name, "r") as in_file:
    ins_info = json.load(in_file)

In [28]:
ins_info[0:5]

[{'lastname': 'Gamalinda',
  'firstname': 'Mario Eric',
  'uni': 'meg2109',
  'name': 'Mario Eric Gamalinda'},
 {'lastname': 'Quay',
  'firstname': 'Michelle',
  'uni': 'mq2213',
  'name': 'Michelle Quay'},
 {'lastname': 'Loetscher',
  'firstname': 'Kyoko',
  'uni': 'kml2168',
  'name': 'Kyoko Loetscher'},
 {'lastname': 'Araneo',
  'firstname': 'Margaret',
  'uni': 'ma3749',
  'name': 'Margaret Araneo'},
 {'lastname': 'Wu',
  'firstname': 'Geraldine',
  'uni': 'gaw18',
  'name': 'Geraldine Wu'}]

In [29]:
len(ins_info)

2557

In [30]:
instructor_df = pandas.DataFrame(ins_info)

In [31]:
instructor_df

       lastname   firstname      uni                  name
0     Gamalinda  Mario Eric  meg2109  Mario Eric Gamalinda
1          Quay    Michelle   mq2213         Michelle Quay
2     Loetscher       Kyoko  kml2168       Kyoko Loetscher
3        Araneo    Margaret   ma3749       Margaret Araneo
4            Wu   Geraldine    gaw18          Geraldine Wu
...         ...         ...      ...                   ...
2552   Mneimneh     Mohamed   mm5482      Mohamed Mneimneh
2553       Shah        Neel  nhs2115             Neel Shah
2554     Gamper     Michael   mg3330        Michael Gamper
2555        Lok        Dana  djl2161              Dana Lok
2556     Hagari         Ben   bh2468            Ben Hagari

[2557 rows x 4 columns]

In [33]:
instructor_df.to_sql("instructors", schema="w4111_hw1", con=engine, index=False, if_exists="replace")

2557

In [35]:
courses_file_name = os.path.join(
    "/Users",
    "donaldferguson",
    "Dropbox",
    "00Spring2023",
    "Intro_to_Databases_S23",
    "HW-Assignments",
    "Assignments",
    "S23-W4111-HW-1",
    "data",
    "course_feed.json"
)

In [36]:
courses_file_name

'/Users/donaldferguson/Dropbox/00Spring2023/Intro_to_Databases_S23/HW-Assignments/Assignments/S23-W4111-HW-1/data/course_feed.json'

In [39]:
with open(courses_file_name, "r") as in_file:
    c_info = json.load(in_file)

In [40]:
courses_df = pandas.DataFrame(c_info)

In [41]:
courses_df

,CallNumber,Term,ExamMeet,SubtermCode,DivisionCode,Instructor3Name,NumFixedUnits,DivisionName,Meets5,Meets1,...,CampusName,SubtermName,CourseSubtitle,Instructor1Name,ChargeAmt2,ChargeAmt1,Course,ChargeMsg2,ClassNotes,Meets3
0,14481,20212,,,BU,,,School Of Business,,,...,Morningside,,Financial Accounting,"SOURSOURIAN, JESSICA",,,ACCT5001BXMT,,,
1,12440,20212,,,BU,,030,School Of Business,,S 09:00A-10:15ABTBA RTBA,...,Morningside,,Financial Accounting,"ZIV, AMIR",,,ACCT5001B001,,,
2,12441,20212,,,BU,,030,School Of Business,,S 09:00A-10:15ABTBA RTBA,...,Morningside,,Financial Accounting,"ZIV, AMIR",,,ACCT5001B002,,,
3,12442,20212,,,BU,,030,School Of Business,,MW 09:00A-10:15ABTBA RTBA,...,Morningside,,Financial Accounting,"ZIV, AMIR",,,ACCT5001B300,,,
4,14266,20212,,,BU,,030,School Of Business,,TS 09:00A-10:15ABTBA RTBA,...,Morningside,,Financial Accounting,"FACULTY, .",,,ACCT5001B400,,,
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
20381,10192,20222,,A,SS,,030,Summer Session,,MW 05:30P-08:40PBTBA RTBA,...,Morningside,05/23-07/01,ART WRITING FOR WRITERS,"DONOVAN, THOMAS A",,20.00,WRIT3215W001,,,
20382,10198,20222,,B,SS,,030,Summer Session,,TR 09:00A-12:10PBTBA RTBA,...,Morningside,07/05-08/12,WRITING CHILDREN'S BOOKS,"CATALANOTTO, PETER",,20.00,WRIT4313S001,,,
20383,10187,20222,,A,SS,,030,Summer Session,,MW 05:30P-08:40PBTBA RTBA,...,Morningside,05/23-07/01,TRAVEL WRITING,"FOX, PORTER T",,20.00,WRIT4320S001,,,
20384,10193,20222,,B,SS,,030,Summer Session,,,...,Morningside,07/05-08/12,WRITING THE YOUNG ADULT N,,,20.00,WRIT4323S001,,,
20385,10194,20222,,B,SS,,030,Summer Session,,MW 05:30P-08:40PBTBA RTBA,...,Morningside,07/05-08/12,HOW TO WRITE FUNNY,"MARX, PATRICIA A",,20.00,WRIT4810S001,,,

In [42]:
courses_df.to_sql("courses", schema="w4111_hw1", con=engine, index=False, if_exists="replace")

20386

In [58]:
%%sql 

create table w4111_hw1.sections as
    select course, coursetitle, coursesubtitle, instructor1name,
        schoolcode, numfixedunits, maxsize,  callnumber, term
    from w4111_hw1.courses;

 * mysql+pymysql://root:***@localhost
20386 rows affected.

[]

In [46]:
course_instructor_file_name = os.path.join(
    "/Users",
    "donaldferguson",
    "Dropbox",
    "00Spring2023",
    "Intro_to_Databases_S23",
    "HW-Assignments",
    "Assignments",
    "S23-W4111-HW-1",
    "data",
    "evalkit_eval_courses_instructors.json"
)

with open(course_instructor_file_name, "r") as in_file:
    course_instructor = json.load(in_file)

In [52]:
course_instructor_map = []

for k,v in course_instructor.items():
    for i in v:
        course_instructor_map.append(
            {"section_no": k, "instructor_uni": i})

In [53]:
course_instructor_map[0:10]

[{'section_no': 'ERMCK5250_001_2020_3', 'instructor_uni': 'rsf2133'},
 {'section_no': 'HISTW2439_002_2020_3', 'instructor_uni': 'gm522'},
 {'section_no': 'GERMC1101_006_2020_3', 'instructor_uni': 'sss2284'},
 {'section_no': 'ECONW4911_001_2020_3', 'instructor_uni': 'skg21'},
 {'section_no': 'HISTW3815_001_2019_3', 'instructor_uni': 'dgk2114'},
 {'section_no': 'CLENW3983_001_2021_3', 'instructor_uni': 'bhe2'},
 {'section_no': 'CHNSW4012_001_2021_3', 'instructor_uni': 'zs2132'},
 {'section_no': 'APANK5310_004_2020_3', 'instructor_uni': 'nm2608'},
 {'section_no': 'MATHG6153_001_2021_1', 'instructor_uni': 'ic2354'},
 {'section_no': 'LATNW4105_001_2019_3', 'instructor_uni': 'gdw5'}]

In [54]:
ins_map_df = pandas.DataFrame(course_instructor_map)

In [55]:
ins_map_df.to_sql("section_instructor", schema="w4111_hw1", con=engine, index=False, if_exists="replace")

9058

In [63]:
%sql use w4111_hw1;
%sql drop table if exists cu_departments;
%sql create table cu_departments as select distinct departmentname, departmentcode from courses

 * mysql+pymysql://root:***@localhost
0 rows affected.
 * mysql+pymysql://root:***@localhost
0 rows affected.
 * mysql+pymysql://root:***@localhost
191 rows affected.

[]

In [68]:
%%sql

use w4111_hw1;

create table sections_fixed as
select
        course as section_full,
        substr(course, 1, 4) as dept_code,
        substr(course, 5, 4) as course_no,
        substr(course, 9, 1) as faculty_code,
        substr(course, 10, 3) as section_no,
        coursetitle,
        coursesubtitle,
        instructor1name as instructorname,
        schoolcode,
        numfixedunits,
        callnumber,
        substr(term, 1, 4) as section_year,
        substr(term, 5, 1) as semester
from sections;

 * mysql+pymysql://root:***@localhost
0 rows affected.
20386 rows affected.

[]

In [73]:
%%sql

create table sections_fixed_2 as
select concat(
        dept_code,
        faculty_code, course_no,
        "_",
        section_no,
        "_",
        section_year,
        "_",
        semester) as section_id,
    sections_fixed.* from sections_fixed;

 * mysql+pymysql://root:***@localhost
20386 rows affected.

[]